<div class="centerTitle">Руководство по игре</div>
<div class="guide">
    <div class="title">Проект создан «just for fun», в качестве обучения.</div>

    <div class="title">Игра против ИИ не предусмотрена!</div>
    <p>Для начала игры, против других игроков, нужно создать «комнату».</p>

    <div class="title">Создание комнаты, параметры:</div>
    <ul class="main">
        <li><span class="params">длина поля</span>, от 3 до 20 клеток. Задается длина стороны игрового поля, игровое поле представлено в виде квадрата, например 3*3, 20*20 клеток;</li>
        <li><span class="params">фигур в ряд</span>, от 3 до 6. Задается количество фигур, которые нужно собрать в ряд для победы, или получения одного очка;</li>
        <li><span class="params">играть на очки</span>, на выбор «да», «нет»: 
            <ul class="sub">
                <li>«да», за каждый собранный ряд фигур, будет засчитано 1 очко, игра будет продолжаться пока, кто то из игроков не наберет нужное количество очей;</li>
                <li>«нет», игрок выигрывает собрав нужное количество фигур в ряд.</li>
            </ul>
        <li><span class="params">выбор фигуры</span>, крестик, нолик, треугольник, квадратик;</li>
        <li><span class="params">блиц</span>, «да», «нет»:
            <ul class="sub">
                <li>«да»,  будет установлено время для каждого игрока, например 300 секунд, и из них каждый ход будет отниматься время потраченное данным игроком на ход;</li>
                <li>«нет», каждый раз время игрока на ход, будет обновляться на установленное время для хода.</li>
            </ul>
        <li><span class="params">время на ход</span>, от 30 до 300 секунд, по истечению времени, данный игрок проиграет. Если игроков более 2, то проигравший игрок будет перемещен в зрители, и ему будет засчитано поражение, оставшиеся игроки продолжат игру;</li>
        <li><span class="params">количество игроков</span>, от 2 до 4. В одной комнате могут одновременно играть  2-4 человека, которые авторизованы на сайте, или же зашли через гостевой аккаунт.</li>
    </ul>
    <div class="title">Начало игры:</div>

    <p>Создав комнату нужно ждать, что бы присоединилось выбранное количество игроков. <span class="important">(Если нет игроков онлайн, и никто не заходит в комнату, можно протестировать игру, создав в другом браузере еще один аккаунт).</span>
    «Создатель»  может выбрасывать из комнаты «не понравившихся» игроков.  А так же может начать игру, или удалить комнату.
    Для начала игры нужно, что бы в комнату зашло, выбранное количество игроков, и все выбрали себе фигуру для игры, после «создатель» сможет начать игру.</p>

    <div class="title">Игровой интерфейс:</div>
    <p><span class="params">Ход назад</span> — после нажатия данной кнопки, остальным игрокам будет выведено диалоговое окно, для подтверждения или отмены «Хода назад», если все игроки подтвердят запрос, последний ход будет отменен, если хотя бы один игрок нажмет отмену, ход отменен не будет.</p>
    <p><span class="params">Предложить ничью</span> — всем игрокам будет выведено диалоговое окно с предложением на ничью, если все подтвердят, будет объявлена ничья.</p>
    <p><span class="params">Сдаться</span> — игроку будет засчитано поражение, если в комнате больше 2 человек, игроку будет присвоен статус «Зрителя», а оставшиеся игроки продолжат игру, также пользователи находящиеся в комнате в статусе «Зрители», могут занять место сдавшегося игрока, и сам сдавшийся игрок может зайти в игру обратно. Если игроков двое, то игра будет окончена сдавшемуся игроку будет засчитано поражение, а другому победа.</p>
    <p><span class="params">Выйти</span> — действие аналогично «Сдаться», только игрок полностью выйдет из комнаты.</p>

    <p>Если выбрано 4 и больше фигур в ряд для победы,  при игре будут подсвечиваться предполагаемые угрозы.</p>

    <p>По окончанию игры, будет предложение сыграть еще раз. Если выбранное, в начале игры, количество игроков, подтвердит предложение, игра будет запущена еще раз с заданными в этой комнате параметрами.  Если в течении 10 минут игра не будет запущена еще раз, комната будет автоматически удалена.</p>

    <div class="title">Зрители:</div>
    <p>Пользователи могут заходить в комнату с уже начатой игрой, и следить за ней, а также занять место сдавшегося, или вышедшего игрока.</p>

    <div class="title">Профиль:</div>
    <p>У каждого пользователя есть свой игровой профиль, который могут просмотреть другие пользователи, нажав на нужный логин в списке игроков онлайн. В профиле будет указано:</p>
    <ul class="mail">
        <li>логин игрока;</li>
        <li>дата регистрации;</li>
        <li>почта (скрыта по умолчанию);</li>
        <li>статистика побед, поражений, ничьих.</li>
    </ul>

    <div class="title">Редактирование профиля:</div>
    <p>Каждый пользователь может изменить свой логин, пароль, почту, и разрешить или запретить показ своей почты, при просмотре другими пользователями его профиля.</p>
    <p>Для гостевого аккаунта так же доступно редактирование профиля, пользователь может изменить логин, задать пароль и почту.</p>
</div>

